Deleting this assembly will remove the assembly from the project and any views associated with that assembly.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DeleteAssemblyInstWithViewsWarn { get; }
  Visual Basic
Public Shared ReadOnly Property DeleteAssemblyInstWithViewsWarn As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DeleteAssemblyInstWithViewsWarn {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures AssemblyFailures Class
  Autodesk.Revit.DB Namespace